---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.RemovingInvalidDPartParents
source: html/f23d6710-dcfe-bf04-58bf-19658453cf8e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.RemovingInvalidDPartParents Property

Can't make Parts out of these Elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId RemovingInvalidDPartParents { get; }
```